finance.org
#+TITLE: Personal Finance Resources
* Advice
  - [[https://DaveRamsey.com][Dave Ramsey]]: Famous for [[https://daveramsey.com/blog/what-is-a-budget][budgeting]] and the [[https://daveramsey.com/dave-ramsey-7-baby-steps][7 baby steps]], which are simpler and easier than other advice
    - [[https://daveramsey.com/budgeting/how-to-budget/][How to budget]]
    - [[https://daveramsey.com/blog/what-is-a-budget][What is a budget?]]
    - [[https://daveramsey.com/blog/zero-based-budget-what-why][Zero based budgeting]]: I recommend this style of budgeting
  - [[https://Bogleheads.org][Bogleheads]]: Investing advice inspired by John Bogle
    - [[https://bogleheads.org/wiki/Getting_started][Bogleheads Wiki]]: A fountain of information and examples
      - [[https://bogleheads.org/wiki/Prioritizing_investments][Prioritizing investments]]: Where should you invest first?
  - [[https://reddit.com/r/personalfinance/wiki][PersonalFinance Reddit]]: Significantly mirrors Bogleheads philosophy
    - [[https://reddit.com/r/personalfinance/wiki/commontopics][Where should my next dollar go?]]: Similar to Bogleheads investment order and includes [[https://reddit.com/r/personalfinance/wiki/commontopics#wiki_the_flowchart][a flowchart]]
  - [[https://moneyguy.com][The Money Guy Show]]: Mirrors Bogleheads advice with their [[https://moneyguy.com/2018/08/financial-order-of-operations-how-to-prioritize-your-financial-goals/][order of operations]]
* Research
  - [[https://Investopedia.com][Investopedia]]: Definitions of financial terms and basic advice
  - [[https://Nerdwallet.com][Nerdwallet]]: Reviews and search functions for institutions and accounts
    - [[https://nerdwallet.com/rates/savings-account?active_offers%3Dtrue&bank_type%3Dbank&bank_type%3Dcredit_union&bank_type%3Dinternet_bank&deposit_minimum%3D1&min_ratings%3D3&sort_key%3Dapy&sort_order%3Ddesc][High interest savings accounts]]
    - [[https://nerdwallet.com/checking-accounts?account_features%3Dno_monthly_fee&active_offers%3Dtrue&bank_type%3Dbank&bank_type%3Dcredit_union&bank_type%3Dinternet_bank&checking_daily_balance%3D0&customer_type%3Deveryone&direct_deposit%3D0&sort_key%3Dmonthly_cost&sort_order%3Ddesc][Cheap checking accounts]]
    - [[https://nerdwallet.com/best/banking/savings-accounts][Best Savings Accounts]]
    - [[https://nerdwallet.com/best/banking/checking-accounts][Best Checking Accounts]]
    - [[https://nerdwallet.com/best/banking/money-market-accounts][Best Money Market Accounts]]
  - [[https://myfico.com][myFICO]]: Official credit score education website
    - [[https://myfico.com/credit-education][Credit basics]]
    - [[https://myfico.com/credit-education/whats-in-your-credit-score][How credit is calculated]]
* YouTube Channels
  - [[https://YouTube.com/user/FinancingLife101][FinancingLife]]
  - [[https://YouTube.com/user/MoneyGuyShow][The Money Guy Show]]
  - [[https://YouTube.com/channel/UCL8w_A8p8P1HWI3k6PR5Z6w][Two Cents]]
  - [[https://YouTube.com/channel/UCV6KDgJskWaEckne5aPA0aQ][Graham Stephan]]
  - [[https://YouTube.com/channel/UCzpwkXk_GlfmWntZ9v4l3Tg][The Dave Ramsey Show LIVE]]
  - [[https://YouTube.com/user/ChrisHogan360][Chris Hogan]]
  - [[https://YouTube.com/user/DaveRamseyShow][The Dave Ramsey Show]]
  - [[https://YouTube.com/channel/UCFCEuCsyWP0YkP3CZ3Mr01Q][The Plain Bagel]]
  - [[https://YouTube.com/channel/UCGy7SkBjcIAgTiwkXEtPnYg][Andrei Jikh]]
  - [[https://YouTube.com/channel/UCbta0n8i6Rljh0obO7HzG9A][Joseph Carlson]]
  - [[https://YouTube.com/user/kenclarkchannel][Kenny Robinson]]
  - [[https://YouTube.com/channel/UCEVXhsR6e3D522BHQj9MlLg][The Credit Shifu]]
  - [[https://YouTube.com/channel/UC2cC48A261pBVKztLyzOAnA][Ask Sebby]]
  - [[https://YouTube.com/channel/UCBIt1VN5j37PVM8LLSuTTlw][Improvement Pill]]
  - [[https://YouTube.com/user/whygoldandsilver][GoldSilver with Mike Maloney]]
  - [[https://YouTube.com/user/SchiffReport][Peter Schiff]]
* YouTube Playlists
  - [[https://YouTube.com/watch?v%3DatZJ4lU3IBE&list%3DPL21534875BFC50EEE][Rules About Investing For Beginners]]
  - [[https://YouTube.com/watch?v%3DZFRReCL_lLw&list%3DPLdpkIg5_Ms4At-DZbPbkxujh2EGOnOu6H][Why Bother With Bonds]]
  - [[https://YouTube.com/watch?v%3DKliNYvTasgg&list%3DPLJ1Tti2OGXsCHUCtlfnT2wUFShFdj1iHc][Robert Kiyosaki explains his philosophy: Income, Expenses, Assets, & Liabilities, Employee, Business, & Investor taxation]]
* Videos
  - [[https://YouTube.com/watch?v%3DMD71ryp39x0][Robert Kiyosaki: Protect and Cover Your ASSets with Corporations and Entities]]
  - [[https://YouTube.com/watch?v%3DXdSp5GXbiE4][Protecting assets from legal settlements with LLCs: Proper Use of LLCs for Real Estate]]
  - [[https://YouTube.com/watch?v%3Dul32Yf9KJB0&list%3DPL3FUah8ohZLyEGjh5I38MHL0Sl1fuzs13&index%3D15][Why You Should Use a Land Trust for Real Estate]]
  - [[https://YouTube.com/watch?v%3DNNS8aWhNpS4&list%3DPL3FUah8ohZLyEGjh5I38MHL0Sl1fuzs13&index%3D14][What a land trust protects against: Purchasing Property With a Land Trust]]
* Books
  These books are frequently available as audiobooks on YouTube and the authors may have channels, as well as physical or digital forms on Amazon or at your local library
  | Title                      | Author           |           ISBN |
  |----------------------------+------------------+----------------|
  | [[https://YouTube.com/watch?v%3DgliZHyovI7c][Rich Dad Poor Dad]]          | [[https://YouTube.com/user/RDdotcom][Robert Kiyosaki]]  | 978-1612680170 |
  | [[https://YouTube.com/watch?v%3DehCVLRHOxBY][The Richest Man in Babylon]] | George S. Clason | 978-1508524359 |
  | The Total Money Makeover   | [[https://YouTube.com/user/DaveRamseyShow][Dave Ramsey]]      | 978-1595555274 |
  | Everyday Millionaires      | [[https://YouTube.com/user/ChrisHogan360][Chris Hogan]]      | 978-0977489527 |
  | [[https://YouTube.com/watch?v%3DZUbfskQ-GAY][Think and Grow Rich]]        | Napoleon Hill    | 978-1585424337 |
* Financial Institutions
** Investment
   - [[https://Vanguard.com][Vanguard]]: Especially competitive ETFs & Mutual Funds
   - [[https://Fidelity.com][Fidelity]]: Very competitive investing
   - [[https://mbsy.co/CCHdh][M1 Finance]]: Automatic rebalancing and perfect tax strategy
     - My Pies
       - [[https://m1.finance/1lLWbJ7NG][Short-Term Savings]]
       - [[https://m1.finance/-2Ypz4Tre][Taxable Investing]]
   - [[https://wealthfront.com/c/affiliates/invited/AFFA-RXMQ-8ZFA-ZXV3][Wealthfront]]: High interest cash account, advice & personal wealth tracking
   - [[https://www.betterment.com/?referral_key%3Devanmccarter][Betterment]]: High interest cash account
   - [[https://nbkc.com][NBKC]]: High interest checking and wealth tracking tools
   - [[https://t-mobilemoney.com][T-Mobile Money]]: High interest checking, especially for mobile customers
** Insurance
   - [[https://Zanderins.com][Zander Insurance]]: Selects policies between several insurance companies
   - [[https://usaa.com][USAA]]: Competitive insurance
** Loans
   - [[https://NavyFederal.org][Navy Federal]]: Credit union with good interest rates and rewards
* Financial Charting
  - [[https://finance.yahoo.com][Yahoo Finance]]
  - [[https://tradingview.com][TradingView]]
* Credit
  "[[https://YouTube.com/watch?v%3DDyV0OfU3-FU&list%3DPLE88E9ICdiphYjJkeeLL2O09eJoC8r7Dc&index%3D1][Gold is money]]. Everything [[https://YouTube.com/watch?v%3DCxHarNKW7Go][else]] is [[https://YouTube.com/watch?v%3DPHe0bXAIuk0][credit]]." - J. P. Morgan
  
  Credit can multiply your spending, which can allow you to buy assets sooner but always creates a liability for yourself. 
  If you buy a poor asset or just increase your spending, debt you incurred will still be there to drain your wealth from you. 
  
  Credit is based off your main credit report, which details all your open accounts and recent blemishes. 
  If your credit report looks good, you'll likely have a good credit score as well. 
  
  It's free and harmless to check your credit report and your credit score. You are encouraged to and should do so periodically to measure your progress and correct errors. 
  You can request your credit report from each of the three major credit agencies (Equifax, Experian, Transunion) through [[https://annualcreditreport.com][annualcreditreport.com]] or each agency's resources. 
  Credit card issuers will often give you a free credit score every few months, since they check themselves anyway! 
  
  See the [[https://myfico.com][myFico]] links in [[Research]] for more information and sources
  
  See [[https://Nerdwallet.com][Nerdwallet]] or some [[YouTube%20Channels][YouTube Channels]] for credit card advice
