finance.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Personal Finance Resources</title>
<!-- 2019-11-02 Sat 03:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Evan James McCarter" />
</head>
<body>
<div id="content">
<h1 class="title">Personal Finance Resources</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Advice</a></li>
<li><a href="#sec-2">2. Research</a></li>
<li><a href="#sec-3">3. YouTube Channels</a></li>
<li><a href="#sec-4">4. YouTube Playlists</a></li>
<li><a href="#sec-5">5. Videos</a></li>
<li><a href="#sec-6">6. Books</a></li>
<li><a href="#sec-7">7. Financial Institutions</a>
<ul>
<li><a href="#sec-7-1">7.1. Investment</a></li>
<li><a href="#sec-7-2">7.2. Insurance</a></li>
<li><a href="#sec-7-3">7.3. Loans</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Financial Charting</a></li>
<li><a href="#sec-9">9. Credit</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Advice</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://DaveRamsey.com">Dave Ramsey</a>: Famous for <a href="https://daveramsey.com/blog/what-is-a-budget">budgeting</a> and the <a href="https://daveramsey.com/dave-ramsey-7-baby-steps">7 baby steps</a>, which are simpler and easier than other advice
<ul class="org-ul">
<li><a href="https://daveramsey.com/budgeting/how-to-budget/">How to budget</a>
</li>
<li><a href="https://daveramsey.com/blog/what-is-a-budget">What is a budget?</a>
</li>
<li><a href="https://daveramsey.com/blog/zero-based-budget-what-why">Zero based budgeting</a>: I recommend this style of budgeting
</li>
</ul>
</li>
<li><a href="https://Bogleheads.org">Bogleheads</a>: Investing advice inspired by John Bogle
<ul class="org-ul">
<li><a href="https://bogleheads.org/wiki/Getting_started">Bogleheads Wiki</a>: A fountain of information and examples
<ul class="org-ul">
<li><a href="https://bogleheads.org/wiki/Prioritizing_investments">Prioritizing investments</a>: Where should you invest first?
</li>
</ul>
</li>
</ul>
</li>
<li><a href="https://reddit.com/r/personalfinance/wiki">PersonalFinance Reddit</a>: Significantly mirrors Bogleheads philosophy
<ul class="org-ul">
<li><a href="https://reddit.com/r/personalfinance/wiki/commontopics">Where should my next dollar go?</a>: Similar to Bogleheads investment order and includes <a href="https://reddit.com/r/personalfinance/wiki/commontopics#wiki_the_flowchart">a flowchart</a>
</li>
</ul>
</li>
<li><a href="https://moneyguy.com">The Money Guy Show</a>: Mirrors Bogleheads advice with their <a href="https://moneyguy.com/2018/08/financial-order-of-operations-how-to-prioritize-your-financial-goals/">order of operations</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Research</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://Investopedia.com">Investopedia</a>: Definitions of financial terms and basic advice
</li>
<li><a href="https://Nerdwallet.com">Nerdwallet</a>: Reviews and search functions for institutions and accounts
<ul class="org-ul">
<li><a href="https://nerdwallet.com/rates/savings-account?active_offers=true&bank_type=bank&bank_type=credit_union&bank_type=internet_bank&deposit_minimum=1&min_ratings=3&sort_key=apy&sort_order=desc">High interest savings accounts</a>
</li>
<li><a href="https://nerdwallet.com/checking-accounts?account_features=no_monthly_fee&active_offers=true&bank_type=bank&bank_type=credit_union&bank_type=internet_bank&checking_daily_balance=0&customer_type=everyone&direct_deposit=0&sort_key=monthly_cost&sort_order=desc">Cheap checking accounts</a>
</li>
<li><a href="https://nerdwallet.com/best/banking/savings-accounts">Best Savings Accounts</a>
</li>
<li><a href="https://nerdwallet.com/best/banking/checking-accounts">Best Checking Accounts</a>
</li>
<li><a href="https://nerdwallet.com/best/banking/money-market-accounts">Best Money Market Accounts</a>
</li>
</ul>
</li>
<li><a href="https://myfico.com">myFICO</a>: Official credit score education website
<ul class="org-ul">
<li><a href="https://myfico.com/credit-education">Credit basics</a>
</li>
<li><a href="https://myfico.com/credit-education/whats-in-your-credit-score">How credit is calculated</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> YouTube Channels</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://YouTube.com/user/FinancingLife101">FinancingLife</a>
</li>
<li><a href="https://YouTube.com/user/MoneyGuyShow">The Money Guy Show</a>
</li>
<li><a href="https://YouTube.com/channel/UCL8w_A8p8P1HWI3k6PR5Z6w">Two Cents</a>
</li>
<li><a href="https://YouTube.com/channel/UCV6KDgJskWaEckne5aPA0aQ">Graham Stephan</a>
</li>
<li><a href="https://YouTube.com/channel/UCzpwkXk_GlfmWntZ9v4l3Tg">The Dave Ramsey Show LIVE</a>
</li>
<li><a href="https://YouTube.com/user/ChrisHogan360">Chris Hogan</a>
</li>
<li><a href="https://YouTube.com/user/DaveRamseyShow">The Dave Ramsey Show</a>
</li>
<li><a href="https://YouTube.com/channel/UCFCEuCsyWP0YkP3CZ3Mr01Q">The Plain Bagel</a>
</li>
<li><a href="https://YouTube.com/channel/UCGy7SkBjcIAgTiwkXEtPnYg">Andrei Jikh</a>
</li>
<li><a href="https://YouTube.com/channel/UCbta0n8i6Rljh0obO7HzG9A">Joseph Carlson</a>
</li>
<li><a href="https://YouTube.com/user/kenclarkchannel">Kenny Robinson</a>
</li>
<li><a href="https://YouTube.com/channel/UCEVXhsR6e3D522BHQj9MlLg">The Credit Shifu</a>
</li>
<li><a href="https://YouTube.com/channel/UC2cC48A261pBVKztLyzOAnA">Ask Sebby</a>
</li>
<li><a href="https://YouTube.com/channel/UCBIt1VN5j37PVM8LLSuTTlw">Improvement Pill</a>
</li>
<li><a href="https://YouTube.com/user/whygoldandsilver">GoldSilver with Mike Maloney</a>
</li>
<li><a href="https://YouTube.com/user/SchiffReport">Peter Schiff</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> YouTube Playlists</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://YouTube.com/watch?v=atZJ4lU3IBE&list=PL21534875BFC50EEE">Rules About Investing For Beginners</a>
</li>
<li><a href="https://YouTube.com/watch?v=ZFRReCL_lLw&list=PLdpkIg5_Ms4At-DZbPbkxujh2EGOnOu6H">Why Bother With Bonds</a>
</li>
<li><a href="https://YouTube.com/watch?v=KliNYvTasgg&list=PLJ1Tti2OGXsCHUCtlfnT2wUFShFdj1iHc">Robert Kiyosaki explains his philosophy: Income, Expenses, Assets, &amp; Liabilities, Employee, Business, &amp; Investor taxation</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Videos</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://YouTube.com/watch?v=MD71ryp39x0">Robert Kiyosaki: Protect and Cover Your ASSets with Corporations and Entities</a>
</li>
<li><a href="https://YouTube.com/watch?v=XdSp5GXbiE4">Protecting assets from legal settlements with LLCs: Proper Use of LLCs for Real Estate</a>
</li>
<li><a href="https://YouTube.com/watch?v=ul32Yf9KJB0&list=PL3FUah8ohZLyEGjh5I38MHL0Sl1fuzs13&index=15">Why You Should Use a Land Trust for Real Estate</a>
</li>
<li><a href="https://YouTube.com/watch?v=NNS8aWhNpS4&list=PL3FUah8ohZLyEGjh5I38MHL0Sl1fuzs13&index=14">What a land trust protects against: Purchasing Property With a Land Trust</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Books</h2>
<div class="outline-text-2" id="text-6">
<p>
These books are frequently available as audiobooks on YouTube and the authors may have channels, as well as physical or digital forms on Amazon or at your local library
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Title</th>
<th scope="col" class="left">Author</th>
<th scope="col" class="right">ISBN</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><a href="https://YouTube.com/watch?v=gliZHyovI7c">Rich Dad Poor Dad</a></td>
<td class="left"><a href="https://YouTube.com/user/RDdotcom">Robert Kiyosaki</a></td>
<td class="right">978-1612680170</td>
</tr>

<tr>
<td class="left"><a href="https://YouTube.com/watch?v=ehCVLRHOxBY">The Richest Man in Babylon</a></td>
<td class="left">George S. Clason</td>
<td class="right">978-1508524359</td>
</tr>

<tr>
<td class="left">The Total Money Makeover</td>
<td class="left"><a href="https://YouTube.com/user/DaveRamseyShow">Dave Ramsey</a></td>
<td class="right">978-1595555274</td>
</tr>

<tr>
<td class="left">Everyday Millionaires</td>
<td class="left"><a href="https://YouTube.com/user/ChrisHogan360">Chris Hogan</a></td>
<td class="right">978-0977489527</td>
</tr>

<tr>
<td class="left"><a href="https://YouTube.com/watch?v=ZUbfskQ-GAY">Think and Grow Rich</a></td>
<td class="left">Napoleon Hill</td>
<td class="right">978-1585424337</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Financial Institutions</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Investment</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li><a href="https://Vanguard.com">Vanguard</a>: Especially competitive ETFs &amp; Mutual Funds
</li>
<li><a href="https://Fidelity.com">Fidelity</a>: Very competitive investing
</li>
<li><a href="https://mbsy.co/CCHdh">M1 Finance</a>: Automatic rebalancing and perfect tax strategy
<ul class="org-ul">
<li>My Pies
<ul class="org-ul">
<li><a href="https://m1.finance/1lLWbJ7NG">Short-Term Savings</a>
</li>
<li><a href="https://m1.finance/-2Ypz4Tre">Taxable Investing</a>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="https://wealthfront.com/c/affiliates/invited/AFFA-RXMQ-8ZFA-ZXV3">Wealthfront</a>: High interest cash account, advice &amp; personal wealth tracking
</li>
<li><a href="https://www.betterment.com/?referral_key=evanmccarter">Betterment</a>: High interest cash account
</li>
<li><a href="https://nbkc.com">NBKC</a>: High interest checking and wealth tracking tools
</li>
<li><a href="https://t-mobilemoney.com">T-Mobile Money</a>: High interest checking, especially for mobile customers
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Insurance</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li><a href="https://Zanderins.com">Zander Insurance</a>: Selects policies between several insurance companies
</li>
<li><a href="https://usaa.com">USAA</a>: Competitive insurance
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Loans</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li><a href="https://NavyFederal.org">Navy Federal</a>: Credit union with good interest rates and rewards
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Financial Charting</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://finance.yahoo.com">Yahoo Finance</a>
</li>
<li><a href="https://tradingview.com">TradingView</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Credit</h2>
<div class="outline-text-2" id="text-9">
<p>
"Gold is money. <a href="https://YouTube.com/watch?v=CxHarNKW7Go">Everything else</a> is <a href="https://YouTube.com/watch?v=PHe0bXAIuk0">credit</a>." - J. P. Morgan
</p>

<p>
Credit can multiply your spending, which can allow you to buy assets sooner but always creates a liability for yourself. 
If you buy a poor asset or just increase your spending, debt you incurred will still be there to drain your wealth from you. 
</p>

<p>
Credit is based off your main credit report, which details all your open accounts and recent blemishes. 
If your credit report looks good, you'll likely have a good credit score as well. 
</p>

<p>
It's free and harmless to check your credit report and your credit score. You are encouraged to and should do so periodically to measure your progress and correct errors. 
You can request your credit report from each of the three major credit agencies (Equifax, Experian, Transunion) through <a href="https://annualcreditreport.com">annualcreditreport.com</a> or each agency's resources. 
Credit card issuers will often give you a free credit score every few months, since they check themselves anyway! 
</p>

<p>
See the <a href="https://myfico.com">myFico</a> links in <a href="#sec-2">2</a> for more information and sources
</p>

<p>
See <a href="https://Nerdwallet.com">Nerdwallet</a> or some <i>YouTube Channels</i> for credit card advice
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Evan James McCarter</p>
<p class="date">Created: 2019-11-02 Sat 03:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
